cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'awscli'
brew 'coreutils'
brew 'grc'
brew 'imagemagick'
brew 'kubernetes-cli'
brew 'node'
brew 'openssl'
brew 'postgresql@15'
brew 'rbenv'
brew 'redis'
brew 'ruby-build'
brew 'spark'
brew 'stripe/stripe-cli/stripe'
brew 'wget'
brew 'yarn'

# Leaving my personal cask list here for reference. Current machine has many of these already installedm
#   causing the Brewfile to fail. Uncomment as needed.
#
cask '1password-cli'
cask '1password'
cask 'alfred'
cask 'cleanshot'
cask 'cyberduck'
cask 'dash@6' # Skip Dash 7+ for now, as it requires a monthly subscription
cask 'google-chrome'
cask 'istat-menus'
cask 'slack'
cask 'spotify'
cask 'visual-studio-code'
cask 'zoom'
