cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask-versions'

brew 'coreutils'
brew 'grc'
brew 'imagemagick'
brew 'node'
brew 'openssl'
brew 'postgresql'
brew 'redis'
brew 'ruby-build'
brew 'spark'
brew 'stripe/stripe-cli/stripe'
brew 'wget'

cask '1password'
cask 'alfred'
cask 'cleanshot'
cask 'cyberduck'
cask 'dash6' # Skip Dash 7+ for now, as it requires a monthly subscription
cask 'google-chrome'
cask 'istat-menus'
cask 'slack'
cask 'spotify'
cask 'visual-studio-code'
cask 'zoom'
